# Chapter 9 - Pandas
## Building Machine Learning and Deep Learning Models on Google Cloud Platform
### Ekaba Bisong

To begin with Pandas, we’ll start by importing the Pandas module

In [2]:
import pandas as pd

# Series

Let us consider an example of creating a Series data structure

In [2]:
# create a Series object
my_series = pd.Series([2,4,6,8], index=['e1','e2','e3','e4'])
# print out data in Series data structure
my_series

e1    2
e2    4
e3    6
e4    8
dtype: int64

In [3]:
# check the data type of the variable
type(my_series)

pandas.core.series.Series

In [4]:
# return the elements of the Series data structure
my_series.values

array([2, 4, 6, 8])

In [5]:
# retrieve elements from Series data structure based on their assigned indices
my_series['e1']

2

In [6]:
# return all indices of the Series data structure
my_series.index

Index(['e1', 'e2', 'e3', 'e4'], dtype='object')

Elements in a Series data structure can be assigned the same indices.

In [7]:
# create a Series object with elements sharing indices
my_series = pd.Series([2,4,6,8], index=['e1','e2','e1','e2'])
# note the same index assigned to various elements
my_series

e1    2
e2    4
e1    6
e2    8
dtype: int64

In [8]:
# get elements using their index
my_series['e1']

e1    2
e1    6
dtype: int64

# DataFrames

Let’s see examples of working with DataFrames.

In [9]:
# create a data frame
my_DF = pd.DataFrame({'age': [15,17,21,29,25], \
            'state_of_origin':['Lagos', 'Cross River', 'Kano', 'Abia', 'Benue']})
my_DF

   age state_of_origin
0   15           Lagos
1   17     Cross River
2   21            Kano
3   29            Abia
4   25           Benue

NumPy is frequently used together with Pandas. Let’s import the NumPy library and use some of its functions to demonstrate other ways of creating a quick DataFrame.

In [10]:
import numpy as np

# create a 3x3 dataframe of numbers from the normal distribution
my_DF = pd.DataFrame(np.random.randn(3,3),\
            columns=['First','Second','Third'])
my_DF

      First    Second     Third
0 -0.969829 -2.118089 -0.371391
1  1.309455  0.548701  1.237010
2  0.685800 -0.048262 -1.010324

In [11]:
# check the dimensions
my_DF.shape

(3, 3)

Let’s examine some other operations with DataFrames.

In [12]:
# create a python dictionary
my_dict = {'State':['Adamawa', 'Akwa-Ibom', 'Yobe', 'Rivers', 'Taraba'], \
            'Capital':['Yola','Uyo','Damaturu','Port-Harcourt','Jalingo'], \
            'Population':[3178950, 5450758, 2321339, 5198716, 2294800]}
my_dict

{'Capital': ['Yola', 'Uyo', 'Damaturu', 'Port-Harcourt', 'Jalingo'],
 'Population': [3178950, 5450758, 2321339, 5198716, 2294800],
 'State': ['Adamawa', 'Akwa-Ibom', 'Yobe', 'Rivers', 'Taraba']}

In [13]:
# confirm dictionary type
type(my_dict)

dict

In [14]:
# create DataFrame from dictionary
my_DF = pd.DataFrame(my_dict)
my_DF

         Capital  Population      State
0           Yola     3178950    Adamawa
1            Uyo     5450758  Akwa-Ibom
2       Damaturu     2321339       Yobe
3  Port-Harcourt     5198716     Rivers
4        Jalingo     2294800     Taraba

In [15]:
# check DataFrame type
type(my_DF)

pandas.core.frame.DataFrame

In [16]:
# retrieve column names of the DataFrame
my_DF.columns

Index(['Capital', 'Population', 'State'], dtype='object')

In [17]:
# the data type of `DF.columns` method is an Index
type(my_DF.columns)

pandas.core.indexes.base.Index

In [18]:
# retrieve the DataFrame values as a NumPy ndarray
my_DF.values

array([['Yola', 3178950, 'Adamawa'],
       ['Uyo', 5450758, 'Akwa-Ibom'],
       ['Damaturu', 2321339, 'Yobe'],
       ['Port-Harcourt', 5198716, 'Rivers'],
       ['Jalingo', 2294800, 'Taraba']], dtype=object)

In [19]:
# the data type of  `DF.values` method is an numpy ndarray
type(my_DF.values)

numpy.ndarray

Let’s check the data type of each column in the DataFrame.

In [20]:
# Let’s check the data type of each column in the DataFrame
my_DF.dtypes

Capital       object
Population     int64
State         object
dtype: object

An object data type in Pandas represents Strings.

# Data Indexing (Selection/ Subsets)

First let’s create a dataframe. Observe the default integer indices assigned.

In [21]:
# create the dataframe
my_DF = pd.DataFrame({'age': [15,17,21,29,25], \
            'state_of_origin':['Lagos', 'Cross River', 'Kano', 'Abia', 'Benue']})
my_DF

   age state_of_origin
0   15           Lagos
1   17     Cross River
2   21            Kano
3   29            Abia
4   25           Benue

## Selecting a column from a DataFrame

Remember that the data type of a DataFrame column is a Series because it is a vector or 1-Dimensional array.

In [22]:
my_DF['age']

0    15
1    17
2    21
3    29
4    25
Name: age, dtype: int64

In [23]:
# check data type
type(my_DF['age'])

pandas.core.series.Series

## Selecting a row from a DataFrame

Let’s select the first row from the DataFrame.

In [24]:
# using explicit indexing
my_DF.loc[0]

age                   15
state_of_origin    Lagos
Name: 0, dtype: object

In [25]:
# using implicit indexing
my_DF.iloc[0]

age                   15
state_of_origin    Lagos
Name: 0, dtype: object

In [26]:
# let's see the data type
type(my_DF.loc[0])

pandas.core.series.Series

Now let’s create a DataFrame with explicit indexing and test out the iloc and loc methods. Pandas will return an error if `iloc` is used for explicit indexing or if `loc` is used for implicit Python indexing.

In [27]:
my_DF = pd.DataFrame({'age': [15,17,21,29,25], \
            'state_of_origin':['Lagos', 'Cross River', 'Kano', 'Abia', 'Benue']},\
            index=['a','a','b','b','c'])
# observe the string indices
my_DF

   age state_of_origin
a   15           Lagos
a   17     Cross River
b   21            Kano
b   29            Abia
c   25           Benue

In [28]:
# select using explicit indexing
my_DF.loc['a']

   age state_of_origin
a   15           Lagos
a   17     Cross River

In [29]:
# lets try to use loc for implicit indexing
my_DF.loc[0]

TypeError: cannot do label indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [0] of <class 'int'>

## Slice cells by row and column from a DataFrame

First let’s create a DataFrame. Remember, we use `iloc` when no explicit index or row labels are assigned.

In [30]:
my_DF = pd.DataFrame({'age': [15,17,21,29,25], \
            'state_of_origin':['Lagos', 'Cross River', 'Kano', 'Abia', 'Benue']})
my_DF

   age state_of_origin
0   15           Lagos
1   17     Cross River
2   21            Kano
3   29            Abia
4   25           Benue

In [31]:
# select the third row and second column
my_DF.iloc[2,1]

'Kano'

In [32]:
# slice the first 2 rows - indexed from zero, excluding the final index
my_DF.iloc[:2,]

   age state_of_origin
0   15           Lagos
1   17     Cross River

In [33]:
# slice the last three rows from the last column
my_DF.iloc[-3:,-1]

2     Kano
3     Abia
4    Benue
Name: state_of_origin, dtype: object

# DataFrame Manipulation

## Removing a Row/ Column

Note that when a column or row is dropped a new DataFrame or Series is returned without altering the original data structure. However when the attribute `inplace` is set to `True`, the original DataFrame or Series is modified. Let’s see some examples.

In [34]:
# our data frame
my_DF = pd.DataFrame({'age': [15,17,21,29,25], \
            'state_of_origin':['Lagos', 'Cross River', 'Kano', 'Abia', 'Benue']})
my_DF

   age state_of_origin
0   15           Lagos
1   17     Cross River
2   21            Kano
3   29            Abia
4   25           Benue

In [35]:
# drop the 3rd and 4th column
my_DF.drop([2,4])

   age state_of_origin
0   15           Lagos
1   17     Cross River
3   29            Abia

In [36]:
# drop the `age` column
my_DF.drop('age', axis=1)

  state_of_origin
0           Lagos
1     Cross River
2            Kano
3            Abia
4           Benue

In [37]:
# original DataFrame is unchanged
my_DF

   age state_of_origin
0   15           Lagos
1   17     Cross River
2   21            Kano
3   29            Abia
4   25           Benue

In [39]:
# drop using inPlace - to modidy the original DataFrame
my_DF.drop('age', axis=1, inplace=True)

In [40]:
# original DataFrame altered
my_DF

  state_of_origin
0           Lagos
1     Cross River
2            Kano
3            Abia
4           Benue

## Adding a Row/ Column

We can add a new column to a Pandas DataFrame by using the `assign` method.

In [41]:
# show dataframe
my_DF = pd.DataFrame({'age': [15,17,21,29,25], \
            'state_of_origin':['Lagos', 'Cross River', 'Kano', 'Abia', 'Benue']})
my_DF

   age state_of_origin
0   15           Lagos
1   17     Cross River
2   21            Kano
3   29            Abia
4   25           Benue

In [42]:
# add column to data frame
my_DF = my_DF.assign(capital_city = pd.Series(['Ikeja', 'Calabar', \
                                                'Kano', 'Umuahia', 'Makurdi']))
my_DF

   age state_of_origin capital_city
0   15           Lagos        Ikeja
1   17     Cross River      Calabar
2   21            Kano         Kano
3   29            Abia      Umuahia
4   25           Benue      Makurdi

We can also add a new DataFrame column by computing some function on another column. Let’s take an example by adding a column computing the absolute difference of the ages from their mean.

In [43]:
mean_of_age = my_DF['age'].mean()
my_DF['diff_age'] = my_DF['age'].map(lambda x: abs(x-mean_of_age))
my_DF

   age state_of_origin capital_city  diff_age
0   15           Lagos        Ikeja       6.4
1   17     Cross River      Calabar       4.4
2   21            Kano         Kano       0.4
3   29            Abia      Umuahia       7.6
4   25           Benue      Makurdi       3.6

Typically in practice, a fully formed dataset is converted into Pandas for cleaning and data analysis, which does not ideally involve adding a new observation to the dataset. But in the event that this is desired, we can use the `append()` method to achieve this. However, it may not be a computationally efficient action. Let’s see an example.

In [44]:
# show dataframe
my_DF = pd.DataFrame({'age': [15,17,21,29,25], \
            'state_of_origin':['Lagos', 'Cross River', 'Kano', 'Abia', 'Benue']})
my_DF

   age state_of_origin
0   15           Lagos
1   17     Cross River
2   21            Kano
3   29            Abia
4   25           Benue

In [45]:
# add a row to data frame
my_DF = my_DF.append(pd.Series([30 , 'Osun'], index=my_DF.columns), \
                                                        ignore_index=True)
my_DF

   age state_of_origin
0   15           Lagos
1   17     Cross River
2   21            Kano
3   29            Abia
4   25           Benue
5   30            Osun

We observe that adding a new row involves passing to the `append` method, a `Series` object with the `index` attribute set to the columns of the main DataFrame. Since typically, in given datasets, the index is nothing more than the assigned defaults, we set the attribute `ignore_index` to create a new set of default index values with the new row(s).

## Data Alignment

Pandas utilizes data alignment to align indices when performing some binary arithmetic operation on DataFrames. If two or more DataFrames in an arithmetic operation do not share a common index, a `NaN` is introduced denoting missing data. Let’s see examples of this.

In [46]:
# create a 3x3 dataframe - remember randint(low, high, size)
df_A = pd.DataFrame(np.random.randint(1,10,[3,3]),\
            columns=['First','Second','Third'])
df_A

   First  Second  Third
0      9       3      1
1      6       5      5
2      8       9      3

In [47]:
# create a 4x3 dataframe
df_B = pd.DataFrame(np.random.randint(1,10,[4,3]),\
            columns=['First','Second','Third'])
df_B

   First  Second  Third
0      6       1      6
1      9       4      5
2      1       3      3
3      5       1      4

In [48]:
# add df_A and df_B together
df_A + df_B

   First  Second  Third
0   15.0     4.0    7.0
1   15.0     9.0   10.0
2    9.0    12.0    6.0
3    NaN     NaN    NaN

In [49]:
# divide both dataframes
df_A / df_B

      First  Second     Third
0  1.500000    3.00  0.166667
1  0.666667    1.25  1.000000
2  8.000000    3.00  1.000000
3       NaN     NaN       NaN

If we do not want a `NaN` signifying missing values to be imputed, we can use the `fill_value` attribute to substitute with a default value. However, to take advantage of the `fill_value` attribute, we have to use the Pandas arithmetic methods: `add()`, `sub()`, `mul()`, `div()`, `floordiv()`, `mod()`, and `pow()` for addition, subtraction, multiplication, integer division, numeric division, reminder division and exponentiation.

Let’s see examples.

In [50]:
df_A.add(df_B, fill_value=10)

   First  Second  Third
0   15.0     4.0    7.0
1   15.0     9.0   10.0
2    9.0    12.0    6.0
3   15.0    11.0   14.0

## Combining Datasets

We may need to combine two or more data sets together, Pandas provides methods for such operations. We would consider the simple case of combining data frames with shared column names using the concat method.

In [51]:
# combine two dataframes column-wise
pd.concat([df_A, df_B])

   First  Second  Third
0      9       3      1
1      6       5      5
2      8       9      3
0      6       1      6
1      9       4      5
2      1       3      3
3      5       1      4

Observe that the concat method preserves indices by default. We can also concatenate or combine two dataframes by rows (or horizontally). This is done by setting the axis parameter to 1.

In [52]:
# combine two dataframes horizontally
pd.concat([df_A, df_B], axis=1)

   First  Second  Third  First  Second  Third
0    9.0     3.0    1.0      6       1      6
1    6.0     5.0    5.0      9       4      5
2    8.0     9.0    3.0      1       3      3
3    NaN     NaN    NaN      5       1      4

# Handling Missing Data

Dealing with missing data is an integral part of the Data cleaning/ data analysis process. Moreover, some machine learning algorithms will not work in the presence of missing data.

Let’s see some simple Pandas methods for identifying and removing missing data, as well as imputing values into missing data.

## Identifying missing data

In [53]:
# lets create a data frame with missing data
my_DF = pd.DataFrame({'age': [15,17,np.nan,29,25], \
            'state_of_origin':['Lagos', 'Cross River', 'Kano', 'Abia', np.nan]})
my_DF

    age state_of_origin
0  15.0           Lagos
1  17.0     Cross River
2   NaN            Kano
3  29.0            Abia
4  25.0             NaN

Let’s check for missing data in this data frame. The `isnull()` method will return `True` where there is a missing data, whereas the `notnull()` function returns `False`.

In [54]:
my_DF.isnull()

     age  state_of_origin
0  False            False
1  False            False
2   True            False
3  False            False
4  False             True

However, if we want a single answer (i.e., either `True` or `False`) to report if there is a missing data in the data frame, we will first convert the DataFrame to a NumPy array and use the function `any()`.

The `any` function returns `True` when at least one of the elements in the dataset is `True`. In this case, `isnull()` returns a DataFrame of booleans where `True` designates a cell with a missing value.

Let’s see how that works.

In [55]:
my_DF.isnull().values.any()

True

## Removing missing data

Pandas has a function `dropna()` which is used to filter or remove missing data from a DataFrame. `dropna()` returns a new DataFrame without missing data. Let’s see examples of how this works.

In [56]:
# let's see our dataframe with missing data
my_DF = pd.DataFrame({'age': [15,17,np.nan,29,25], \
            'state_of_origin':['Lagos', 'Cross River', 'Kano', 'Abia', np.nan]})
my_DF

    age state_of_origin
0  15.0           Lagos
1  17.0     Cross River
2   NaN            Kano
3  29.0            Abia
4  25.0             NaN

In [57]:
# let's run dropna() to remove all rows with missing values
my_DF.dropna()

    age state_of_origin
0  15.0           Lagos
1  17.0     Cross River
3  29.0            Abia

As we will observe from the above code-block, `dropna()` drops all rows that contain a missing value. But we may not want that. We may rather, for example, want to drop columns with missing data, or drop rows where all the observations are missing or better still remove consequent on the number of observations present in a particular row.

Let’s see examples of this options. First let’s expand our example dataset.

In [58]:
my_DF = pd.DataFrame({'Capital': ['Yola', np.nan, np.nan, 'Port-Harcourt', 'Jalingo'],
 'Population': [3178950, np.nan, 2321339, np.nan, 2294800],
 'State': ['Adamawa', np.nan, 'Yobe', np.nan, 'Taraba'],
 'LGAs': [22, np.nan, 17, 23, 16]})
my_DF

         Capital  LGAs  Population    State
0           Yola  22.0   3178950.0  Adamawa
1            NaN   NaN         NaN      NaN
2            NaN  17.0   2321339.0     Yobe
3  Port-Harcourt  23.0         NaN      NaN
4        Jalingo  16.0   2294800.0   Taraba

Drop columns with `NaN`. This option is not often used in practice.

In [59]:
my_DF.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

Drop rows where all the observations are missing.

In [60]:
my_DF.dropna(how='all')

         Capital  LGAs  Population    State
0           Yola  22.0   3178950.0  Adamawa
2            NaN  17.0   2321339.0     Yobe
3  Port-Harcourt  23.0         NaN      NaN
4        Jalingo  16.0   2294800.0   Taraba

Drop rows based on an observation threshold. By adjusting the `thresh` attribute, we can drop rows where the number of observations in the row is less than the `thresh` value.

In [62]:
# drop rows where number of NaN are less than 3
my_DF.dropna(thresh=3)

   Capital  LGAs  Population    State
0     Yola  22.0   3178950.0  Adamawa
2      NaN  17.0   2321339.0     Yobe
4  Jalingo  16.0   2294800.0   Taraba

## Imputing values into missing data

Imputing values as substitutes for missing data is a standard practice in preparing data for Machine Learning. Pandas has a `fillna()` function for this purpose. A simple approach is to fill `NaNs` with zeros.

In [63]:
my_DF.fillna(0) # we can also run my_DF.replace(np.nan, 0)

         Capital  LGAs  Population    State
0           Yola  22.0   3178950.0  Adamawa
1              0   0.0         0.0        0
2              0  17.0   2321339.0     Yobe
3  Port-Harcourt  23.0         0.0        0
4        Jalingo  16.0   2294800.0   Taraba

Another tactic is to fill missing values with the mean of the column value.

In [64]:
my_DF.fillna(my_DF.mean())

         Capital  LGAs  Population    State
0           Yola  22.0   3178950.0  Adamawa
1            NaN  19.5   2598363.0      NaN
2            NaN  17.0   2321339.0     Yobe
3  Port-Harcourt  23.0   2598363.0      NaN
4        Jalingo  16.0   2294800.0   Taraba

# Data Aggregation (Grouping)

We will touch briefly on a common practice in Data Science, and that is grouping a set of data attributes, either for retrieving some group statistics or applying a particular set of functions to the group. Grouping is commonly used for data exploration and plotting graphs to understand more about the data set. Missing data are automatically excluded in a grouping operation.

Let’s see examples of how this works.

In [65]:
# create a data frame
my_DF = pd.DataFrame({'Sex': ['M', 'F', 'M', 'F','M', 'F','M', 'F'],
 'Age': np.random.randint(15,60,8),
 'Salary': np.random.rand(8)*10000})
my_DF

   Age       Salary Sex
0   56  3936.190562   M
1   41  4936.504637   F
2   57  6865.371298   M
3   51   147.239952   F
4   58  4152.195197   M
5   38  4780.657320   F
6   53  8880.138978   M
7   31  8519.526827   F

Let’s find the mean age and salary for observations in our dataset grouped by `Sex`.

In [66]:
my_DF.groupby('Sex').mean()

       Age       Salary
Sex
F    40.25  4595.982184
M    56.00  5958.474009

We can group by more than one variable. In this case for each Sex group, also group the age and find the mean of the other numeric variables.

In [67]:
my_DF.groupby([my_DF['Sex'], my_DF['Age']]).mean()

              Salary
Sex Age
F   31   8519.526827
    38   4780.657320
    41   4936.504637
    51    147.239952
M   53   8880.138978
    56   3936.190562
    57   6865.371298
    58   4152.195197

Also, we can use a variable as a group key to run a group function on another variable or sets of variables.

In [68]:
my_DF['Age'].groupby(my_DF['Salary']).mean()

Salary
147.239952     51
3936.190562    56
4152.195197    58
4780.657320    38
4936.504637    41
6865.371298    57
8519.526827    31
8880.138978    53
Name: Age, dtype: int64

# Statistical Summaries

Descriptive statistics is an essential component of the Data Science pipeline. By investigating the properties of the dataset, we can gain a better understanding of the data and the relationship between the variables. This information is useful in making decisions about the type of data transformations to carry out or the types of learning algorithms to spot-check. Let’s see some examples of simple statistical functions in Pandas.

First, we’ll create a Pandas dataframe.

In [70]:
my_DF = pd.DataFrame(np.random.randint(10,80,[7,4]),\
            columns=['First','Second','Third', 'Fourth'])
my_DF

   First  Second  Third  Fourth
0     72      76     54      57
1     47      59     41      32
2     35      75     25      56
3     25      40     72      63
4     34      71     46      19
5     40      32     29      35
6     72      71     44      24

Use the `describe` function to obtain summary statistics of a dataset. Eight statistical measures are displayed. They are: count, mean, standard deviation, minimum value, 25th percentile, 50th percentile or median, 75th percentile and the maximum value.

In [71]:
my_DF.describe()

           First     Second      Third     Fourth
count   7.000000   7.000000   7.000000   7.000000
mean   46.428571  60.571429  44.428571  40.857143
std    18.680267  17.821870  15.714719  17.582459
min    25.000000  32.000000  25.000000  19.000000
25%    34.500000  49.500000  35.000000  28.000000
50%    40.000000  71.000000  44.000000  35.000000
75%    59.500000  73.000000  50.000000  56.500000
max    72.000000  76.000000  72.000000  63.000000

## Correlation

Correlation shows how much relationship exists between two variables. Parametric machine learning methods such as logistic and linear regression can take a performance hit when variables are highly correlated. The correlation values range from -1 to 1, with 0 indicating no correlation at all. -1 signifies that the variables are strongly negatively correlated while 1 shows that the variables are strongly positively correlated. In practice, it is safe to eliminate variables that have a correlation value greater than -0.7 or 0.7. A common correlation estimate in use is the Pearson’s Correlation Coefficient.

In [72]:
my_DF.corr(method='pearson')

           First    Second     Third    Fourth
First   1.000000  0.495762 -0.032524 -0.183476
Second  0.495762  1.000000 -0.143844 -0.111923
Third  -0.032524 -0.143844  1.000000  0.340464
Fourth -0.183476 -0.111923  0.340464  1.000000

## Skewness

Another important statistical metric is the skewness of the dataset. Skewness is when a bell-shaped or Normal distribution is shifted towards the right or the left. Pandas offer a convenient function called skew() to check the skewness of each variable. Values close to 0 are more normally distributed with less skew.

In [73]:
my_DF.skew()

First     0.713207
Second   -0.951717
Third     0.648955
Fourth    0.103368
dtype: float64

# Importing Data

Again, getting data into the programming environment for analysis is a fundamental and first step for any data analytics or machine learning task. In practice, data usually comes in a comma separated value, `csv` format.

In [6]:
my_DF = pd.read_csv('states.csv', sep=',', header = 0)

In [7]:
# read the top 5 rows
my_DF.head()

       state  capital
0       Abia  Umuahia
1    Adamawa     Yola
2  Akwa Ibom      Uyo
3    Anambra     Awka
4     Bauchi   Bauchi

To export a DataFrame back to csv.

In [8]:
# save DataFrame to csv
my_DF.to_csv('save_states.csv')